--
-- Файл сгенерирован с помощью SQLiteStudio v3.3.3 в Вс май 22 18:31:31 2022
--
-- Использованная кодировка текста: windows-1251
--
PRAGMA foreign_keys = off;
BEGIN TRANSACTION;

-- Таблица: orders
CREATE TABLE IF NOT EXISTS orders (
    id_main    INTEGER PRIMARY KEY NOT NULL,
    surname    STRING (40),
    name       STRING (40),
    phone      STRING (40),
    id_cake    INTEGER REFERENCES cake (id_cake) ON DELETE CASCADE ON UPDATE CASCADE,
    date_begin DATE,
    date_end   DATE
);

INSERT INTO orders (id_main,
                          surname,
                          name,
                          phone,
                          id_cake,
                          date_begin,
                          date_end
                      )
                      VALUES
                      (
                          1,
                          'Иванов',
                          'Игорь',
                          '8(977)626-57-18',
                          3,
                          '2022-05-01',
                          '2022-05-02'
                      ),
                      (
                          2,
                          'Сидоров',
                          'Станислав',
                          '8(435)136-53-73',
                          1,
                          '2022-05-02',
                          '2022-05-12'
                      ),
                      (
                          3,
                          'Кургатов',
                          'Михаил',
                          '8(456)346-74-11',
                          2,
                          '2022-06-07',
                          '2022-06-10'
                      ),
                      (
                          4,
                          'Мирин',
                          'Евгений',
                          '8(745)734-84-46',
                          3,
                          '2022-06-25',
                          '2022-06-29'
                      ),
                      (
                          5,
                          'Птушкин',
                          'Василий',
                          '8(845)923-84-58',
                          2,
                          '2022-07-07',
                          '2022-07-14'
                      ),
                      (
                          6,
                          'Рыжин',
                          'Сергей',
                          '8(192)323-33-55',
                          4,
                          '2022-08-11',
                          '2022-08-18'
                      ),
                      (
                          8,
                          'Лосев',
                          'Олег',
                          '8(453)738-22-35',
                          1,
                          '2022-08-21',
                          '2022-08-26'
                      ),
                      (
                          9,
                          'Курицев',
                          'Андрей',
                          '8(837)436-29-99',
                          2,
                          '2022-11-04',
                          '2022-11-14'
                      ),
                      (
                          10,
                          'Мушкин',
                          'Даниил',
                          '8(923)483-82-74',
                          3,
                          '2022-11-07',
                          '2022-11-12'
                      ),
                      (
                          11,
                          'Пушкин',
                          'Кирилл',
                          '8(115)929-93-44',
                          2,
                          '2022-11-13',
                          '2022-11-15'
                      );

COMMIT TRANSACTION;
PRAGMA foreign_keys = on;
